{
    "country_code": [
      "GBR",
      "AUS",
      "CAN",
      "NZL",
      "IRL",
      "USA"
    ],
    "category": "Personal Services",
    "image_url": "https://api.neuroschemas.app/images/hairdressers_640x480.jpg",
    "name": "Hairdressers",
    "shortuuid": "D181B0",
    "events": [
      {
        "event_name": "Booking and before going to the hairdresser",
        "rank": 1,
        "behaviours": [
          {
            "rank": 1,
            "type": "covid19_norm",
            "description": "Even hairdressers that a person could walk into without an appointment, normally now require an appointment, due to the restrictions related to the COVID19 pandemic. "
          },
          {
            "type": "prescriptive_norm",
            "description": "Prospective customers can find hairdressers in a variety of ways including by exploring the local area, searching online, or through recommendations.",
            "rank": 2
          },
          {
            "rank": 3,
            "description": "Most hairdressers require booking before an appointment, this is usually done via the phone, although more hairdressers are enabling online booking. When booking customers need to state what service (or combination of services) they require e.g. blow-dry, colour, cut, restyle, and wash. A customer may also need to state the length or type of hair that they have, in order to ensure that the hairdresser creates an appointment of the right length.",
            "type": "prescriptive_norm"
          },
          {
            "description": "Customers may want to ask when booking their appointment for an indicative price, which will be dependent on the services required and who does the service (e.g. how experienced the stylist is).",
            "type": "descriptive_norm",
            "rank": 4
          },
          {
            "description": "A customer should inform the hairdresser as soon as possible if they can no longer make their appointment (the hairdresser should also do the same). Some hairdressers may charge a fee for missed appointments, or may (normally only after repeated late cancellations or not showing up for an appointment) refuse service to the customer.",
            "rank": 5,
            "type": "descriptive_norm"
          },
          {
            "type": "desired_norm",
            "rank": 6,
            "description": "When booking a hair appointment on the phone customers usually just talk about their hairdressing needs, rather than general or social chit chat, unless the customer has been to the hairdresser before, or knows the hairdresser."
          },
          {
            "type": "desired_norm",
            "description": "Before going to the hairdresser, especially if having a restyle or colour, the customer may want to think about what hairstyle and colour they would like. Inspiration for different hairstyles and colours can be found in magazines or online. It is often useful for the customer to take a picture with them to the salon to show the hairdresser. ",
            "rank": 7
          }
        ],
        "behaviours_available": true,
        "event_image_url": "https://api.neuroschemas.app/images/hairdressers_booking_640x480.jpg"
      },
      {
        "behaviours": [
          {
            "rank": 1,
            "type": "covid19_norm",
            "description": "Hairdressing salons may require their customers to queue outside of the salon due to COVID19 restrictions, this may be especially true if a customer arrives early for their appointment. "
          },
          {
            "description": "Customers should arrive at the time of their appointment or 5 to 10 minutes early.",
            "rank": 2,
            "type": "prescriptive_norm"
          },
          {
            "description": "If a customer is going to be slightly late for their appointment (perhaps 5 to 10 minutes), it is good practice/polite for customers to ring the hairdressing salon to let them know and ask if they can still fit the customer in. If they can, when the customer arrives, they may want to apologise and thank the hairdresser.",
            "type": "descriptive_norm",
            "rank": 3
          },
          {
            "rank": 4,
            "type": "descriptive_norm",
            "description": "Customer's hair should be clean (even if the customer is having it washed at the salon) and free of any hair product. "
          },
          {
            "rank": 5,
            "description": "When arriving at the hairdressing salon customers will usually see a reception desk and waiting area. Customers need to check in at the waiting area, state their name and time of their appointment, and then usually wait in the waiting area.",
            "type": "descriptive_norm"
          },
          {
            "type": "unpopular_norm",
            "description": "Customers not showing up for their appointment, especially with late notice or no notice at all. ",
            "rank": 6
          },
          {
            "rank": 7,
            "type": "unpopular_norm",
            "description": "Customers being late for their appointment."
          }
        ],
        "behaviours_available": true,
        "event_name": "Going to and arriving at hairdressing salon",
        "event_image_url": "https://api.neuroschemas.app/images/hairdressers_640x480.jpg",
        "rank": 2
      },
      {
        "behaviours": [
          {
            "description": "Masks are required to be worn whilst in the salon, unless exempt. ",
            "rank": 1,
            "type": "covid19_norm"
          },
          {
            "rank": 2,
            "type": "prescriptive_norm",
            "description": "Whilst waiting in the waiting area customers need to be aware that they could be called at any time, and they need to respond to this. "
          },
          {
            "type": "prescriptive_norm",
            "description": "When the hairdresser is ready for the customer, they will call the customer over to a certain seat, which the customer needs to respond to. The hairdresser or another member of staff may take the customer's coat at this time. ",
            "rank": 3
          },
          {
            "rank": 4,
            "type": "descriptive_norm",
            "description": "Most customers either just wait whilst in the waiting area or busy themselves looking at magazines, which are often provided, or by using their phone on silent. "
          },
          {
            "description": "If a customer has waited past their appointment time (normally 10 to 15 minutes more) they may ask the receptionist or hairdresser how much longer it will be. ",
            "type": "descriptive_norm",
            "rank": 5
          },
          {
            "description": "When a customer is seated in the hairdressers chair the hairdresser will usually introduce themselves and ask a general question like \"What are we doing today?\". The customer needs to tell the hairdresser what service they have booked for, and what they want their hair to look like (e.g. how much, usually in inches the customer wants cut off, does the customer what a fringe?, where does the customer what their parting?, etc. This is an opportunity for the customer to show any photos of hairstyles that the customer likes. The hairdresser may also have suggestions on what they think will suit the customer. ",
            "rank": 6,
            "type": "descriptive_norm"
          },
          {
            "description": "It is at this time that a hairdressing gown is usually put on. ",
            "rank": 7,
            "type": "descriptive_norm"
          },
          {
            "rank": 8,
            "type": "injunctive_norm",
            "description": "The customer and the hairdresser usually come to agreement through discussion on what hairstyle the customer wants. If the customer and the hairdresser disagree, it is the customer's wishes that are more important. "
          },
          {
            "rank": 9,
            "description": "Using offensive language or language that is personally demeaning to anyone. ",
            "type": "unpopular_norm"
          },
          {
            "rank": 10,
            "description": "Talking loudly on the phone. (The customer may want to inform the salon they need to step out for a moment, if the customer needs to take a phone call). ",
            "type": "unpopular_norm"
          }
        ],
        "event_image_url": "https://api.neuroschemas.app/images/hairdressers_waiting_area_640x480.jpg",
        "rank": 3,
        "event_name": "Waiting in the waiting area for the hairdresser and the consultation"
      },
      {
        "behaviours": [
          {
            "type": "descriptive_norm",
            "rank": 1,
            "description": "If the customer is having their hair coloured, it is usual for this to be done before the washing or cutting of the hair. "
          },
          {
            "type": "descriptive_norm",
            "rank": 2,
            "description": "The hairdresser (or colourist in some salons) will ask where they want the colour in their hair/what type of colour they want. This question is about the distribution of colour in the hair e.g. colour all over, highlights, lowlights, just the ends coloured)."
          },
          {
            "rank": 3,
            "description": "The hairdresser will generally show customers a small range of colours that match the customer's general wishes, and the customer will pick a colour (or more than one colour out). The hairdresser may offer suggestions to help the customer if wanted. ",
            "type": "descriptive_norm"
          },
          {
            "type": "descriptive_norm",
            "description": "Once a colour (or colour) has been picked out, the hairdresser will usually go to a back room to mix the colour.",
            "rank": 4
          },
          {
            "rank": 5,
            "description": "When the colour is mixed the hairdresser will return and beginning colouring the customer's hair. ",
            "type": "descriptive_norm"
          },
          {
            "type": "descriptive_norm",
            "description": "The hairdresser may move the customer's chair and/or ask the customer to move their head whilst they are applying colour.",
            "rank": 6
          },
          {
            "rank": 7,
            "description": "Customers often engage in general chit-chat with the hairdresser and sometimes with the other customer's. ",
            "type": "descriptive_norm"
          },
          {
            "rank": 8,
            "type": "descriptive_norm",
            "description": "Often once the hairdresser has applied the colour, the customer will need to wait for the colour to develop. During this time the hairdresser may see other customers. The customer may quietly read a magazine or use their phone on silent. "
          },
          {
            "rank": 9,
            "type": "descriptive_norm",
            "description": "The hairdresser will check how the colour is developing, and will say when it has developed enough. "
          },
          {
            "rank": 10,
            "description": "Conversation should generally be kept to topics more likely to be considered \"safe\". These may include general conversations around topics like the weather, holidays, hobbies, etc. ",
            "type": "desired_norm"
          },
          {
            "type": "unpopular_norm",
            "description": "Customers talking on their phone.",
            "rank": 11
          },
          {
            "rank": 12,
            "type": "unpopular_norm",
            "description": "Customers (and hairdressers) using offensive language or demeaning people. "
          }
        ],
        "behaviours _available": true,
        "event_image_url": "https://api.neuroschemas.app/images/hairdressers_colouring_640x480.jpg",
        "event_name": "Colouring of hair",
        "rank": 4
      },
      {
        "event_name": "Washing of the hair",
        "behaviours _available": true,
        "behaviours": [
          {
            "rank": 1,
            "description": "Most (but not all) people going to the hairdresser will have their hair washed, as it is generally easier to cut damp hair.",
            "type": "descriptive_norm"
          },
          {
            "rank": 2,
            "description": "Hair washing is usually done after a colour (if the customer is having a colour done) and before a cut. ",
            "type": "descriptive_norm"
          },
          {
            "description": "The customer will be taken to the sinks where a customer sits with their back to the sink and leans make to have their hair washed. ",
            "type": "descriptive_norm",
            "rank": 3
          },
          {
            "rank": 4,
            "type": "descriptive_norm",
            "description": "The person washing the hair will ask if the temperature is okay, whether the customer wants the hair conditioned, and in some salons if the customer would like a head massage. "
          },
          {
            "description": "Once the hair is washed and rinsed the customer will sit back up, the hair will be wrapped in a towel, and the customer will usually be shown back to the same seat in the hairdressing/cutting area. ",
            "type": "descriptive_norm",
            "rank": 5
          },
          {
            "rank": 6,
            "description": "Customers often engage in general chit-chat with the hairdresser. ",
            "type": "descriptive_norm"
          },
          {
            "rank": 7,
            "type": "desired_norm",
            "description": "Conversation should generally be kept to topics more likely to be considered \"safe\". These may include general conversations around topics like the weather, holidays, hobbies, etc. "
          },
          {
            "description": "Customers talking on their phone.",
            "rank": 8,
            "type": "unpopular_norm"
          },
          {
            "rank": 9,
            "description": "Customers (and hairdressers) using offensive language or demeaning people. ",
            "type": "unpopular_norm talking on their phone."
          }
        ],
        "rank": 5,
        "event_image_url": "https://api.neuroschemas.app/images/hairdressers_washing_hair_640x480.jpg"
      },
      {
        "rank": 6,
        "event_name": "Having a haircut",
        "behaviours _available": true,
        "event_image_url": "https://api.neuroschemas.app/images/hairdressers_cutting_hair_640x480.jpg",
        "behaviours": [
          {
            "type": "prescriptive_norm",
            "rank": 1,
            "description": "Customers need to tell the hairdresser as soon as possible if they don't like what is being done to their hair. "
          },
          {
            "description": "It is generally understood by both customers and hairdressers that hairdressing is a personal service, and involves the hairdresser getting closer to the customer that would be usual in other situations. ",
            "type": "prescriptive_norm",
            "rank": 2
          },
          {
            "type": "descriptive_norm",
            "rank": 3,
            "description": "Hairdressers often check with the customer during the hair cut if they are happy, if customers are they can nod or say yes, or raise issues if they are not happy. "
          },
          {
            "type": "descriptive_norm",
            "rank": 4,
            "description": "Hairdressers may use a variety of tools to cut and style someone's hair including clips to section off the hair, blow dryer, scissors, combs, and shavers. "
          },
          {
            "type": "descriptive_norm",
            "rank": 5,
            "description": "If a customer has asked for a blow-dry the hairdresser may ask how the customer would like their hair to be styled and what products if any the customer would like the hairdresser to use. "
          },
          {
            "type": "descriptive_norm",
            "rank": 6,
            "description": "Customers often engage in general chit-chat with the hairdresser and sometimes with other customers. "
          },
          {
            "description": "Conversation should generally be kept to topics more likely to be considered \"safe\". These may include general conversations around topics like the weather, holidays, hobbies, etc. ",
            "rank": 7,
            "type": "desired_norm"
          },
          {
            "rank": 8,
            "description": "Customers talking on their phone.",
            "type": "unpopular_norm"
          },
          {
            "rank": 9,
            "type": "unpopular_norm",
            "description": "Customers (and hairdressers) using offensive language or demeaning people. "
          }
        ]
      },
      {
        "rank": 7,
        "event_name": "After the hairdressing services are finished ",
        "event_image_url": "https://api.neuroschemas.app/images/hairdressers_payment_of_service_640x480.jpg",
        "behaviours _available": true,
        "behaviours": [
          {
            "type": "prescriptive_norm",
            "description": "Customers will need to pay for the services that have been provided. ",
            "rank": 1
          },
          {
            "type": "descriptive_norm",
            "rank": 2,
            "description": "When the hairdressing services are finished the hairdresser will ask if you are happy with the service."
          },
          {
            "type": "descriptive_norm",
            "description": "The customer when getting up to leave will remove their hairdressing gown, and generally a member of the salon staff will get the customer's coat (if the customer had one). ",
            "rank": 3
          },
          {
            "rank": 4,
            "type": "descriptive_norm",
            "description": "Many customers, if happy with the service will tip the hairdresser, which usually ranges from 5-20%. 10% can be a good guide. "
          },
          {
            "description": "The hairdresser may ask if you want to book another appointment.",
            "rank": 5,
            "type": "descriptive_norm"
          },
          {
            "type": "misdemeanor",
            "rank": 6,
            "description": "Leaving the hairdresser without paying. If a customer is not happy with the haircut, they will need to tell the hairdresser, who may suggest ways to remedy the haircut. "
          }
        ]
      }
    ],
    "type": "generic",
    "author_name": "Jess Plant",
    "author_location": "GBR",
    "author_email": "",
    "author_twitter": "https://twitter.com/IAmJessPlant",
    "author_linkedin": "https://uk.linkedin.com/in/iamjessplant",
    "author_website": "https://iamjessplant.blogspot.com/",
    "version": "1.0",
    "license": "GNU-GPLv3",
    "license_terms": "https://www.gnu.org/licenses/gpl-3.0.en.html",
    "updatedAt": { "$date": "2022-08-07T09:58:25+0000" }
  }
