{
    "country_code": [
      "GBR"
    ],
    "name": "Respecting People",
    "image_url": "https://api.neuroschemas.app/images/respect_640x480.jpg",
    "shortuuid": "416051",
    "category": "Communication and Social Etiquette",
    "events": [
      {
        "behaviours_available": true,
        "behaviours": [
          {
            "rank": 1,
            "description": "Everyone wants to be treated with respect but there is no perfect approach to respect someone (We all have different backgrounds, values, experiences and encounter each other in different environments and context).",
            "type": "prescriptive_norm"
          },
          {
            "type": "prescriptive_norm",
            "description": "Respect starts when you first meet someone.  Different cultures have have different values and courtesies. In Westerns countries this can involve shaking hands, smiling and making eye contact. In Asia it can involve a slight bow.",
            "rank": 2
          },
          {
            "rank": 3,
            "type": "descriptive_norm",
            "description": "Hugging is usually a sign of kindess and caring. Though some may individuals or culture may feel uncomfortable by such an approach (intrusion of space) that this leads to disrespect."
          },
          {
            "type": "descriptive_norm",
            "description": "Many people can approach new people they meet carefully in order to avoid disrespecting them.",
            "rank": 4
          },
          {
            "rank": 5,
            "description": "Many people can approach new people they meet carefully in order to avoid disrespecting them.",
            "type": "descriptive_norm"
          },
          {
            "rank": 6,
            "type": "descriptive_norm",
            "description": "Many cultures consider someone worthy of respect unless proven otherwise.  This is the case in the UK, USA, Australia, Ireland, Canada and New Zealand."
          },
          {
            "type": "descriptive_norm",
            "description": "Many people believe they should treat others how they would want to be treated.",
            "rank": 7
          },
          {
            "type": "prescriptive_norm",
            "rank": 8,
            "description": "Listening rather than hearing.  Hearing is letting someone speak but listening is attempting to understand what they are trying to communicate."
          },
          {
            "rank": 9,
            "type": "prescriptive_norm",
            "description": "People want to be treated with respect to their own standards of respect but we may not know what they are."
          },
          {
            "rank": 10,
            "type": "descriptive_norm",
            "description": "People can find there is a \"give and take\" approach (a delicate balance to maintain) in respecting yourself and others."
          },
          {
            "rank": 11,
            "description": "People should not disrepect themselves in order to respect others.",
            "type": "prescriptive_norm"
          },
          {
            "description": "If an individual or group is disrespected then many like to believe it can be resolved respectfully by those involved.",
            "type": "desired_norm",
            "rank": 12
          },
          {
            "description": "Affirming others (offer emotional support or encouragement) shows respect.",
            "rank": 13,
            "type": "desired_norm"
          },
          {
            "rank": 14,
            "description": "Most countries including the United Nations (an international organisation) affirm a common standard of rights and treatment of all individuals known as the Universal Declaration of Human Rights (UDHR). The core principles of the UDHR are Fairness, Respect, Equality, Dignity, and Autonomy (FREDA). These are principles you could use in your own approach.",
            "type": "prescriptive_norm"
          },
          {
            "rank": 15,
            "type": "descriptive_norm",
            "description": "Awareness of the audience you are communicating to."
          },
          {
            "type": "unpopular_norm",
            "description": "Not showing respect for ourselves.",
            "rank": 16
          },
          {
            "type": "unpopular_norm",
            "rank": 17,
            "description": "Not showing adequate respect for someone (adequate when it comes to groups maybe context relevant)."
          },
          {
            "type": "unpopular_norm",
            "rank": 18,
            "description": "Disrespecting an individual that causes offence."
          },
          {
            "rank": 19,
            "type": "unpopular_norm",
            "description": "Not learning or practising the correct social etiquette for a social situation (Sometimes this is impossible to meet if you have disability, lack social mobility or face discrimination.  Educating others of this may help.)"
          },
          {
            "rank": 20,
            "description": "Making inappropriate jokes.",
            "type": "unpopular_norm"
          },
          {
            "rank": 21,
            "description": "Disrespecting someone or a group that causes offence, is hateful or breaches their human rights.",
            "type": "infraction"
          },
          {
            "description": "Disrespecting someone or a group that causes offence, is hateful or breaches their human rights.",
            "type": "misdemeanor",
            "rank": 22
          },
          {
            "type": "felony",
            "description": "Disrespecting someone or a group that causes offence, is hateful or breaches their human rights.",
            "rank": 23
          }
        ],
        "rank": 1,
        "event_image_url": "https://api.neuroschemas.app/images/respect_general_640x480.jpg",
        "event_name": "Generally Respecting People"
      },
      {
        "behaviours_available": true,
        "behaviours": [
          {
            "rank": 1,
            "description": "Self respect is being kind to ourselves and loving ourselves no less than a family member.",
            "type": "prescriptive_norm"
          },
          {
            "type": "prescriptive_norm",
            "description": "Self respect is a lifetime of work.",
            "rank": 2
          },
          {
            "rank": 3,
            "type": "prescriptive_norm",
            "description": "Self-respects has it's ebs and flows (ups and downs) like the tide."
          },
          {
            "rank": 4,
            "type": "prescriptive_norm",
            "description": "Many consider self-respect as the foundation of healthy relationships."
          },
          {
            "description": "Setting boundaries with others is a form of self-respect. Eg. We can't always do things for others at the cost of our own wellbeing.",
            "type": "prescriptive_norm",
            "rank": 5
          },
          {
            "description": "Being assertive towards others including when they disrespect you.",
            "type": "prescriptive_norm",
            "rank": 6
          },
          {
            "description": "Accepting yourself even if others don't accept you.",
            "rank": 7,
            "type": "descriptive_norm"
          },
          {
            "description": "Able to handle criticism without taking it personally.",
            "type": "prescriptive_norm",
            "rank": 8
          },
          {
            "description": "Able to handle criticism without taking it personally.",
            "rank": 9,
            "type": "descriptive_norm"
          },
          {
            "rank": 10,
            "type": "descriptive_norm",
            "description": "Taking responsibility for our own life."
          },
          {
            "description": "Letting people walk all over you, giving in to their wishes even though you don't like to.",
            "rank": 11,
            "type": "unpopular_norm"
          },
          {
            "rank": 12,
            "description": "Losing yourself in a relationship where you are completely losing who or what you are.",
            "type": "unpopular_norm"
          },
          {
            "rank": 13,
            "type": "unpopular_norm",
            "description": "You seek attention for something your not in order to gain validation."
          },
          {
            "rank": 14,
            "type": "unpopular_norm",
            "description": "You overindulge in bad habits."
          },
          {
            "rank": 15,
            "description": "You over-care for people who don't care for you (but depends on the relationship for example someone who has reduced capacity).",
            "type": "unpopular_norm"
          },
          {
            "description": "You tolerate verbal, mental, or physical abuse from others or towards yourself.",
            "rank": 16,
            "type": "unpopular_norm"
          },
          {
            "type": "unpopular_norm",
            "rank": 17,
            "description": "You believe your opinion has no value."
          },
          {
            "type": "unpopular_norm",
            "description": "You become untidy and unclean.",
            "rank": 18
          }
        ],
        "event_name": "Self-respect",
        "event_image_url": "https://api.neuroschemas.app/images/respect_self-respect_640x480.jpg",
        "rank": 2
      },
      {
        "behaviours_available": true,
        "event_image_url": "https://api.neuroschemas.app/images/respect_balancing_640x480.jpg",
        "event_name": "Being respectful whilst avoiding disrespect to yourself and others",
        "behaviours": [
          {
            "description": "Most people at times can require tact and diplomacy (skill and sensitivity in dealing with others or with difficult issues) to be respectful. Tact is a skill that often comes with experience whilst for others it may come more natural to them. The greatest leaders are usually the most tactful.",
            "type": "prescriptive_norm",
            "rank": 1
          },
          {
            "type": "prescriptive_norm",
            "description": "Developing and showing empathy for others is a sign of respect to others and yourself. Imagining how you would feel in such a situation, sharing your feelings, making yourself vulnerable or perhaps just further research on the topic can help you develop empathy. Taking action can also be way of showing empathy such as making a donation to a cause, helping someone in need or perhaps involvement in a charitable or philanthropic cause.",
            "rank": 2
          },
          {
            "type": "prescriptive_norm",
            "rank": 3,
            "description": "Taking turns to listen. Listening to try to understand what the other party is communicating and then to take your turn to communicate including conveying or addressing what you believe you have heard. "
          },
          {
            "rank": 4,
            "type": "unpopular_norm",
            "description": "Not listening to others and disregarding your own feelings."
          }
        ],
        "rank": 3
      },
      {
        "behaviours_available": true,
        "rank": 4,
        "event_image_url": "https://api.neuroschemas.app/images/respect_diverse_appearance_640x480.jpg",
        "behaviours": [
          {
            "type": "prescriptive_norm",
            "description": "Most people don't like others commenting on their appearance unless it's a recent positive comment to change in their appearance. E.g. A new hairstyle.",
            "rank": 1
          },
          {
            "description": "People that don't like the appearance of others often will usually still make positive encouraging comments unless it causes widespread offense.",
            "rank": 2,
            "type": "descriptive_norm"
          },
          {
            "type": "injunctive_norm",
            "description": "Many people accept that everyone is different and it's not their role to police diverse appearance.",
            "rank": 3
          },
          {
            "rank": 4,
            "description": "To defend another from personal public attack on appearance if they feel the person they defending has done nothing wrong. (A Human Rights Ideal but may not be true in your community)",
            "type": "desired_norm"
          },
          {
            "rank": 5,
            "type": "prescriptive_norm",
            "description": "Individuals that have an inapproriate appearance for a specific social situation (such as a not keeping to a uniform) expect to receive feedback from a manager or other authority figure."
          },
          {
            "description": "Some people may politely remind a person if they are not in the correct uniform if they have a positive prior relationship with that person.",
            "rank": 6,
            "type": "descriptive_norm"
          },
          {
            "type": "unpopular_norm",
            "description": "Making inappropriate negative comments on anothers appearance.  This can be directly or indirectly.",
            "rank": 7
          },
          {
            "type": "unpopular_norm",
            "rank": 8,
            "description": "Excluding a person based on their appearance."
          },
          {
            "description": "Inappropriate negative comments on a persons size or weight.",
            "type": "unpopular_norm",
            "rank": 9
          },
          {
            "rank": 10,
            "type": "unpopular_norm",
            "description": "Shaming another person for their appearance."
          },
          {
            "rank": 11,
            "description": "Laughing inappropriately at another persons apperance.",
            "type": "unpopular_norm"
          },
          {
            "description": "Staring at another persons appearance.",
            "rank": 12,
            "type": "unpopular_norm"
          },
          {
            "type": "unpopular_norm",
            "rank": 13,
            "description": "Pointing at another persons appearance."
          },
          {
            "description": "Making inappropriate jokes of another persons appearance.",
            "rank": 14,
            "type": "unpopular_norm"
          },
          {
            "type": "unpopular_norm",
            "rank": 15,
            "description": "Taking pictures of another persons for being different and using it on  the internet (such as social media or in group chats) to make fun."
          },
          {
            "type": "infraction",
            "rank": 16,
            "description": "Discrimination against an individual due to their size, weight and appearance."
          }
        ],
        "event_name": "Respecting people of diverse appearance"
      },
      {
        "behaviours_available": true,
        "event_name": "Respecting people of diverse race and culture",
        "behaviours": [
          {
            "type": "prescriptive_norm",
            "rank": 1,
            "description": "Those of different skin colour, racial heritage and ethnicity should be treated with respect, equally, fairly and with dignity."
          },
          {
            "description": "Inviting those with diverse race and culture to provide input.  It's important not to exclude people.",
            "type": "descriptive_norm",
            "rank": 2
          },
          {
            "rank": 3,
            "description": "Educating yourself on racism in order to be more vigilant of it.",
            "type": "descriptive_norm"
          },
          {
            "rank": 4,
            "description": "Those that encounter Racism should report it. E.g. To a tutor if it happens at University.",
            "type": "injunctive_norm"
          },
          {
            "rank": 5,
            "description": "Learning and respecting race and cultural days, movements and celebrations.",
            "type": "descriptive_norm"
          },
          {
            "description": "To call out racism and defend those from racism.",
            "rank": 6,
            "type": "desired_norm"
          },
          {
            "type": "desired_norm",
            "rank": 7,
            "description": "Affirm those with diverse race and culture to provide input."
          },
          {
            "rank": 8,
            "description": "Making inappropriate negative comments based on anothers race.  This can be directly or indirectly.",
            "type": "unpopular_norm"
          },
          {
            "rank": 9,
            "type": "unpopular_norm",
            "description": "Making inappropriate negative comments on their skin colour or cultural traditions."
          },
          {
            "rank": 10,
            "description": "Shaming another person for their skin colour or culture.",
            "type": "unpopular_norm"
          },
          {
            "type": "unpopular_norm",
            "description": "Laughing inappropriately at another person for their skin colour or culture.",
            "rank": 11
          },
          {
            "description": "Staring at another persons because of their skin colour or culture.",
            "rank": 12,
            "type": "unpopular_norm"
          },
          {
            "type": "unpopular_norm",
            "rank": 13,
            "description": "Pointing at another persons because of their skin colour or culture."
          },
          {
            "description": "Making inappropriate jokes about another person because of their skin colour or culture.",
            "type": "unpopular_norm",
            "rank": 14
          },
          {
            "type": "unpopular_norm",
            "description": "Taking pictures of another persons for being different and using it on  the internet (such as social media or in group chats) to make fun.",
            "rank": 15
          },
          {
            "rank": 16,
            "type": "infraction",
            "description": "Making offensive jokes about race and culture. The use of language and intent has the potential for this to also be a misdemeanor or felony."
          },
          {
            "type": "misdemeanor",
            "rank": 17,
            "description": "Using racist language or inciting violenace based on race."
          },
          {
            "rank": 18,
            "description": "Using racist language or inciting violenace based on race.",
            "type": "felony"
          }
        ],
        "rank": 5,
        "event_image_url": "https://api.neuroschemas.app/images/respect_diverse_race_640x480.jpg"
      },
      {
        "rank": 6,
        "event_name": "Respecting people with illness and disability",
        "event_image_url": "https://api.neuroschemas.app/images/respect_disability_640x480.jpg",
        "behaviours_available": true,
        "behaviours": [
          {
            "type": "prescriptive_norm",
            "rank": 1,
            "description": "Those of illness and disbility should be treated with respect, equally, fairly and with dignity."
          },
          {
            "rank": 2,
            "description": "Inviting those with illness and disability to provide input. It's important not to exclude people.",
            "type": "descriptive_norm"
          },
          {
            "rank": 3,
            "description": "Educating yourself on illness, disability and ableism (discrimination in favour of able-bodied people) in order to improve understanding and improve communication.",
            "type": "descriptive_norm"
          },
          {
            "description": "Those that encounter discrimination should report it.",
            "type": "injunctive_norm",
            "rank": 4
          },
          {
            "rank": 5,
            "type": "descriptive_norm",
            "description": "Learning and respecting race and cultural days, movements and celebrations."
          },
          {
            "type": "desired_norm",
            "description": "To call out ableism and defend those from ableism. (A Human Rights Ideal but may not be true in your community)",
            "rank": 6
          },
          {
            "rank": 7,
            "description": "Affirm those with illness and disability to provide input.",
            "type": "desired_norm"
          },
          {
            "rank": 8,
            "type": "unpopular_norm",
            "description": "Making inappropriate negative comments based on anothers illness and disbility.  This can be directly or indirectly."
          },
          {
            "rank": 9,
            "type": "unpopular_norm",
            "description": "Making inappropriate negative comments on their capability due to their illness and disbility."
          },
          {
            "type": "unpopular_norm",
            "description": "Shaming another person for their illness and disbility",
            "rank": 10
          },
          {
            "description": "Laughing inappropriately at another person for their illness and disbility",
            "rank": 11,
            "type": "unpopular_norm"
          },
          {
            "rank": 12,
            "description": "Staring at another persons because of their illness and disbility",
            "type": "unpopular_norm"
          },
          {
            "description": "Pointing at another persons because of their illness and disbility",
            "rank": 13,
            "type": "unpopular_norm"
          },
          {
            "type": "unpopular_norm",
            "description": "Making inappropriate jokes about another person because of their illness and disbility",
            "rank": 14
          },
          {
            "type": "unpopular_norm",
            "rank": 15,
            "description": "Taking pictures of another persons for being different and using it on  the internet (such as social media or in group chats) to make fun."
          },
          {
            "description": "Making offensive jokes about illness and disbility. The use of language and intent has the potential for this to also be a misdemeanor or felony.",
            "rank": 16,
            "type": "infraction"
          },
          {
            "type": "misdemeanor",
            "description": "Using ableist language or inciting violenace based on illness and disbility. (common in the eugenics movement)",
            "rank": 17
          },
          {
            "type": "felony",
            "description": "Using ableist language or inciting violenace based on illness and disbility. (common in the eugenics movement)",
            "rank": 18
          }
        ]
      },
      {
        "event_image_url": "https://api.neuroschemas.app/images/respect_genders_640x480.jpg",
        "event_name": "Respecting people of diverse sex and gender",
        "behaviours_available": true,
        "behaviours": [
          {
            "type": "prescriptive_norm",
            "rank": 1,
            "description": "Those of different sex or gender identity should be treated with respect, equally, fairly and with dignity."
          },
          {
            "description": "To call someone by how they want to be called. E.g. By name and correct pronouns.",
            "rank": 2,
            "type": "prescriptive_norm"
          },
          {
            "description": "Inviting those with diverse sex or gender identity to provide input.",
            "rank": 3,
            "type": "descriptive_norm"
          },
          {
            "description": "Educating yourself on sex or gender identity discrimination in order to be more vigilant of it.",
            "rank": 4,
            "type": "descriptive_norm"
          },
          {
            "type": "injunctive_norm",
            "rank": 5,
            "description": "Those that encounter sexism or discrimination by gender identity should report it."
          },
          {
            "description": "Learning and respecting sex or gender identity days, movements and celebrations.",
            "rank": 6,
            "type": "descriptive_norm"
          },
          {
            "rank": 7,
            "type": "desired_norm",
            "description": "To call out sexism or gender discrimination and defend those who experience it. (A Human Rights Ideal but may not be true in your community)"
          },
          {
            "rank": 8,
            "description": "Affirm those with diverse sex or gender identity to provide input.",
            "type": "desired_norm"
          },
          {
            "type": "unpopular_norm",
            "rank": 9,
            "description": "Making inappropriate negative comments based on sex or gender identity.  This can be directly or indirectly."
          },
          {
            "description": "Making inappropriate negative comments on sex or gender identity.",
            "rank": 10,
            "type": "unpopular_norm"
          },
          {
            "type": "unpopular_norm",
            "rank": 11,
            "description": "Shaming another person for their sex or gender identity."
          },
          {
            "rank": 12,
            "type": "unpopular_norm",
            "description": "Laughing inappropriately at another person for their sex or gender identity."
          },
          {
            "rank": 13,
            "description": "Staring at another person because of their sex or gender identity.",
            "type": "unpopular_norm"
          },
          {
            "rank": 14,
            "type": "unpopular_norm",
            "description": "Pointing at another person because of their sex or gender identity."
          },
          {
            "rank": 15,
            "type": "unpopular_norm",
            "description": "Making inappropriate jokes about another person because of their sex or gender identity."
          },
          {
            "description": "Taking pictures of another persons for being different and using it on  the internet (such as social media or in group chats) to make fun.",
            "rank": 16,
            "type": "unpopular_norm"
          },
          {
            "rank": 17,
            "description": "Making offensive jokes about race and culture. The use of language and intent has the potential for this to also be a misdemeanor or felony.",
            "type": "infraction"
          },
          {
            "rank": 18,
            "description": "Using racist language or inciting violenace based on race.",
            "type": "misdemeanor"
          },
          {
            "rank": 19,
            "type": "felony",
            "description": "Using racist language or inciting violenace based on race."
          }
        ],
        "rank": 7
      },
      {
        "event_name": "Respecting people of diverse sexuality",
        "rank": 8,
        "behaviours_available": true,
        "behaviours": [
          {
            "rank": 1,
            "type": "prescriptive_norm",
            "description": "Those of different sexuality should be treated with respect, equally, fairly and with dignity."
          },
          {
            "type": "descriptive_norm",
            "rank": 2,
            "description": "Inviting those with diverse sexuality to provide input."
          },
          {
            "description": "Educating yourself on homophobia in order to be more vigilant of it.",
            "type": "descriptive_norm",
            "rank": 3
          },
          {
            "rank": 4,
            "description": "Those that encounter homophoba should report it. E.g. To a tutor if it happens at University.",
            "type": "injunctive_norm"
          },
          {
            "type": "descriptive_norm",
            "description": "Learning and respecting gay and lesbian pride days, movements and celebrations.",
            "rank": 5
          },
          {
            "rank": 6,
            "description": "To call out homophobia and defend those from homophobia. (A Human Rights Ideal but may not be true in your community)",
            "type": "desired_norm"
          },
          {
            "type": "desired_norm",
            "rank": 7,
            "description": "Affirm those with diverse sexuality to provide input."
          },
          {
            "description": "Making inappropriate negative comments based on anothers sexuality.  This can be directly or indirectly.",
            "rank": 8,
            "type": "unpopular_norm"
          },
          {
            "rank": 9,
            "type": "unpopular_norm",
            "description": "Making inappropriate negative comments on their sexuality."
          },
          {
            "rank": 10,
            "type": "unpopular_norm",
            "description": "Shaming another person for their sexuality."
          },
          {
            "description": "Laughing inappropriately at another person for their sexuality.",
            "type": "unpopular_norm",
            "rank": 11
          },
          {
            "rank": 12,
            "type": "unpopular_norm",
            "description": "Staring at another persons because of their sexuality. E.g. A couple kissing."
          },
          {
            "rank": 13,
            "description": "Pointing at another persons because of their sexuality.",
            "type": "unpopular_norm"
          },
          {
            "rank": 14,
            "description": "Making inappropriate jokes about another person because of sexuality.",
            "type": "unpopular_norm"
          },
          {
            "rank": 15,
            "description": "Taking pictures of another persons for being different and using it on  the internet (such as social media or in group chats) to make fun.",
            "type": "unpopular_norm"
          },
          {
            "type": "infraction",
            "description": "Making offensive jokes about sexuality. The use of language and intent has the potential for this to also be a misdemeanor or felony.",
            "rank": 16
          },
          {
            "rank": 17,
            "description": "Using homophobic language or inciting violence based on sexuality.",
            "type": "misdemeanor"
          },
          {
            "rank": 18,
            "type": "felony",
            "description": "Using homophobic language or inciting violence based on sexuality."
          }
        ],
        "event_image_url": "https://api.neuroschemas.app/images/respect_sexuality_640x480.jpg"
      },
      {
        "rank": 9,
        "event_image_url": "https://api.neuroschemas.app/images/respect_religions_spirituality_640x480.jpg",
        "behaviours_available": true,
        "behaviours": [
          {
            "type": "prescriptive_norm",
            "description": "Those of different religion and spirituality should be treated with respect, equally, fairly and with dignity.",
            "rank": 1
          },
          {
            "rank": 2,
            "type": "descriptive_norm",
            "description": "Inviting those with diverse religion and spirituality to provide input."
          },
          {
            "type": "descriptive_norm",
            "rank": 3,
            "description": "Educating yourself on religion and spirituality in order to be more aware of prejudice and discrimination (E.g. Antisemitism and Islamophobia)"
          },
          {
            "description": "Those that encounter prejudice and discrimination should report it.",
            "rank": 4,
            "type": "injunctive_norm"
          },
          {
            "type": "descriptive_norm",
            "description": "Learning and respecting spirituality and religious days, movements and celebrations.",
            "rank": 5
          },
          {
            "rank": 6,
            "description": "To call out prejudice and discrimination and defend those from it. (A Human Rights Ideal but may not be true in your community)",
            "type": "desired_norm"
          },
          {
            "type": "desired_norm",
            "rank": 7,
            "description": "Affirm those with diverse religion and spirituality to provide input."
          },
          {
            "rank": 8,
            "type": "unpopular_norm",
            "description": "Making inappropriate negative comments based on anothers religion and spirituality.  This can be directly or indirectly."
          },
          {
            "type": "unpopular_norm",
            "description": "Making inappropriate negative comments on their religion and spirituality.",
            "rank": 9
          },
          {
            "rank": 10,
            "description": "Shaming another person for their religion and spirituality.",
            "type": "unpopular_norm"
          },
          {
            "rank": 11,
            "description": "Laughing inappropriately at another person for their religion and spirituality.",
            "type": "unpopular_norm"
          },
          {
            "rank": 12,
            "description": "Staring at another persons because of their religion and spirituality.",
            "type": "unpopular_norm"
          },
          {
            "rank": 13,
            "description": "Pointing at another persons because of their religion and spirituality.",
            "type": "unpopular_norm"
          },
          {
            "description": "Making inappropriate jokes about another person because of their religion and spirituality.",
            "rank": 14,
            "type": "unpopular_norm"
          },
          {
            "type": "unpopular_norm",
            "description": "Taking pictures of another persons for being different and using it on  the internet (such as social media or in group chats) to make fun.",
            "rank": 15
          },
          {
            "rank": 16,
            "description": "Making offensive jokes about religion and spirituality. The use of language and intent has the potential for this to also be a misdemeanor or felony.",
            "type": "infraction"
          },
          {
            "rank": 17,
            "description": "Using hateful language or inciting violenace based on race.",
            "type": "misdemeanor"
          },
          {
            "rank": 18,
            "type": "felony",
            "description": "Using hateful language or inciting violenace based on race."
          }
        ],
        "event_name": "Respecting people of spirituality and religion"
      },
      {
        "event_image_url": "https://api.neuroschemas.app/images/respect_age_development_640x480.jpg",
        "behaviours_available": true,
        "behaviours": [
          {
            "rank": 1,
            "type": "prescriptive_norm",
            "description": "Those of different age and development should be treated with respect, equally, fairly and with dignity."
          },
          {
            "description": "Inviting those with different age and development to provide input.",
            "type": "descriptive_norm",
            "rank": 2
          },
          {
            "rank": 3,
            "type": "descriptive_norm",
            "description": "Educating yourself on ageism in order to be more vigilant of it."
          },
          {
            "type": "injunctive_norm",
            "rank": 4,
            "description": "Those that encounter ageism should report it."
          },
          {
            "type": "descriptive_norm",
            "description": "Learning and respecting age, traditions and differences among generations.",
            "rank": 5
          },
          {
            "rank": 6,
            "type": "desired_norm",
            "description": "To call out ageism and defend those from discrimination. (A Human Rights Ideal but may not be true in your community)"
          },
          {
            "type": "desired_norm",
            "rank": 7,
            "description": "Affirm and valuing all ages to provide input."
          },
          {
            "type": "unpopular_norm",
            "rank": 8,
            "description": "Making inappropriate negative comments based on age and development.  This can be directly or indirectly."
          },
          {
            "description": "Making inappropriate negative comments on their age and development.",
            "rank": 9,
            "type": "unpopular_norm"
          },
          {
            "rank": 10,
            "description": "Shaming another person for their age and development.",
            "type": "unpopular_norm"
          },
          {
            "description": "Laughing inappropriately at another persons age and development.",
            "rank": 11,
            "type": "unpopular_norm"
          },
          {
            "type": "unpopular_norm",
            "rank": 12,
            "description": "Staring at another persons because their age and development isn't their majority."
          },
          {
            "description": "Pointing at another persons because of their age and development.",
            "rank": 13,
            "type": "unpopular_norm"
          },
          {
            "description": "Making jokes about another person because of their age and development.",
            "type": "unpopular_norm",
            "rank": 14
          },
          {
            "description": "Taking pictures of another persons for being different and using it on  the internet (such as social media or in group chats) to make fun.",
            "type": "unpopular_norm",
            "rank": 15
          },
          {
            "type": "infraction",
            "rank": 16,
            "description": "Making offensive jokes about age and development. The use of language and intent has the potential for this to also be a misdemeanor or felony."
          },
          {
            "description": "Using hateful language or inciting violenace based on age and development.",
            "rank": 17,
            "type": "misdemeanor"
          },
          {
            "rank": 18,
            "description": "Using hateful language or inciting violenace based on age and development.",
            "type": "felony"
          }
        ],
        "event_name": "Respecting people of diverse age and development",
        "rank": 10
      },
      {
        "event_image_url": "https://api.neuroschemas.app/images/respect_nationalities_640x480.jpg",
        "behaviours_available": true,
        "behaviours": [
          {
            "type": "prescriptive_norm",
            "description": "Those of different nationality should be treated with respect, equally, fairly and with dignity.",
            "rank": 1
          },
          {
            "type": "descriptive_norm",
            "rank": 2,
            "description": "Inviting those with diverse nationality to provide input."
          },
          {
            "type": "descriptive_norm",
            "description": "Educating yourself on racism and discrimination in order to be more vigilant of it.",
            "rank": 3
          },
          {
            "description": "Those that encounter racism or discrimination should report it.",
            "type": "injunctive_norm",
            "rank": 4
          },
          {
            "type": "descriptive_norm",
            "rank": 5,
            "description": "Learning and respecting race, national, citizenship and cultural days, movements and celebrations."
          },
          {
            "rank": 6,
            "description": "To call out and defend those from racism and discrimination. (A Human Rights Ideal but may not be true in your community)",
            "type": "desired_norm"
          },
          {
            "type": "desired_norm",
            "rank": 7,
            "description": "Affirm those with diverse race and nation to provide input."
          },
          {
            "type": "desired_norm",
            "description": "Being educated on the history of nations and nationality can help provide social understanding and context.",
            "rank": 8
          },
          {
            "type": "unpopular_norm",
            "rank": 9,
            "description": "Making inappropriate negative comments based on anothers nation or nationality.  This can be directly or indirectly."
          },
          {
            "type": "unpopular_norm",
            "description": "Making inappropriate negative comments on their nation or nationality.",
            "rank": 10
          },
          {
            "type": "unpopular_norm",
            "rank": 11,
            "description": "Shaming another person for their nation or nationality."
          },
          {
            "description": "Laughing inappropriately at another person for their nation or nationality.",
            "rank": 12,
            "type": "unpopular_norm"
          },
          {
            "type": "unpopular_norm",
            "description": "Staring at another persons because of their nation or nationality.",
            "rank": 13
          },
          {
            "rank": 14,
            "type": "unpopular_norm",
            "description": "Pointing at another persons because of their nation or nationality."
          },
          {
            "description": "Making jokes about another person because of their nation or nationality.",
            "type": "unpopular_norm",
            "rank": 15
          },
          {
            "rank": 16,
            "type": "unpopular_norm",
            "description": "Taking pictures of another persons for being different and using it on  the internet (such as social media or in group chats) to make fun."
          },
          {
            "rank": 17,
            "description": "Making offensive jokes about their nation or nationality. The use of language and intent has the potential for this to also be a misdemeanor or felony.",
            "type": "infraction"
          },
          {
            "description": "Using hateful language or inciting violenace based on nation or nationality.",
            "rank": 18,
            "type": "misdemeanor"
          },
          {
            "type": "felony",
            "description": "Using hateful language or inciting violenace based on nation or nationality.",
            "rank": 19
          }
        ],
        "event_name": "Respecting people of diverse nationalities",
        "rank": 11
      },
      {
        "rank": 12,
        "event_name": "Respecting people of authority",
        "behaviours_available": true,
        "behaviours": [
          {
            "rank": 1,
            "description": "Those of authority should be treated with respect, equally, fairly and with dignity.",
            "type": "prescriptive_norm"
          },
          {
            "description": "Those in authority can expect to be addressed with a title.  Eg. Dr, PC, Sir, Ma'am",
            "rank": 2,
            "type": "descriptive_norm"
          },
          {
            "type": "descriptive_norm",
            "description": "Educating yourself on the kinds oif people with authority in your society and community.",
            "rank": 3
          },
          {
            "description": "Learning and respecting how authority is used to participate on occasions and celebrations.",
            "rank": 4,
            "type": "descriptive_norm"
          },
          {
            "rank": 5,
            "description": "Confusing the role of authority with the individual who holds authority. A negative comment could be justified but may not be seen that way if perception of the respect of the authroity and individual are perceived as the same.",
            "type": "unpopular_norm"
          },
          {
            "description": "Confusing the role of authority with the individual who holds authority. A negative comment could be justified but may not be seen that way if perception of the respect of the authroity and individual are perceived as the same.",
            "rank": 6,
            "type": "unpopular_norm"
          },
          {
            "description": "Making offensive jokes about an authority or person in authority.. The use of language and intent has the potential for this to also be a misdemeanor or felony.",
            "rank": 7,
            "type": "infraction"
          },
          {
            "type": "misdemeanor",
            "description": "Using hateful language or inciting violence based on authority.",
            "rank": 8
          },
          {
            "description": "Using hateful language or inciting violence based on authority.",
            "rank": 9,
            "type": "felony"
          }
        ],
        "event_image_url": "https://api.neuroschemas.app/images/respect_authority_640x480.jpg"
      },
      {
        "behaviours_available": true,
        "behaviours": [
          {
            "rank": 1,
            "description": "Those of diverse socio-economic backgrounds with respect, equally, fairly and with dignity.",
            "type": "prescriptive_norm"
          },
          {
            "type": "descriptive_norm",
            "rank": 2,
            "description": "Inviting those with diverse socio-economic backgrounds to provide input."
          },
          {
            "rank": 3,
            "type": "descriptive_norm",
            "description": "Educating yourself on class based discrimination in order to be more vigilant of it."
          },
          {
            "rank": 4,
            "type": "injunctive_norm",
            "description": "Those that encounter discrimination should report it."
          },
          {
            "type": "descriptive_norm",
            "description": "Learning and respecting people whagtever their socio-economic background.",
            "rank": 5
          },
          {
            "rank": 6,
            "description": "To call out class based discrimination and defend those who face it. (A Human Rights Ideal but may not be true in your community)",
            "type": "desired_norm"
          },
          {
            "description": "Affirm those with diverse socio-economic backgrounds.",
            "rank": 7,
            "type": "desired_norm"
          },
          {
            "rank": 8,
            "description": "Making inappropriate negative comments based on anothers diverse socio-economic background.  This can be directly or indirectly.",
            "type": "unpopular_norm"
          },
          {
            "type": "unpopular_norm",
            "rank": 9,
            "description": "Making inappropriate negative comments on their diverse socio-economic background."
          },
          {
            "type": "unpopular_norm",
            "description": "Shaming another person for their diverse socio-economic background.",
            "rank": 10
          },
          {
            "rank": 11,
            "description": "Laughing inappropriately at another person for their diverse socio-economic background.",
            "type": "unpopular_norm"
          },
          {
            "rank": 12,
            "type": "unpopular_norm",
            "description": "Making jokes about another person because of their diverse socio-economic background."
          },
          {
            "type": "unpopular_norm",
            "description": "Taking pictures of another persons for being different and using it on  the internet (such as social media or in group chats) to make fun.",
            "rank": 13
          },
          {
            "rank": 14,
            "type": "infraction",
            "description": "Making offensive jokes about diverse socio-economic backgrounds. The use of language and intent has the potential for this to also be a misdemeanor or felony."
          },
          {
            "type": "misdemeanor",
            "rank": 15,
            "description": "Using hateful language or inciting violence based on diverse socio-economic backgrounds."
          },
          {
            "description": "Using hateful language or inciting violence based on diverse socio-economic backgrounds.",
            "rank": 16,
            "type": "felony"
          }
        ],
        "event_image_url": "https://api.neuroschemas.app/images/respect_socio-economic_640x480.jpg",
        "event_name": "Respecting people of diverse socio-economic backgrounds",
        "rank": 13
      },
      {
        "rank": 14,
        "event_image_url": "https://api.neuroschemas.app/images/respect_diverse_culture_and_customs_640x480.jpg",
        "behaviours_available": true,
        "behaviours": [
          {
            "type": "prescriptive_norm",
            "rank": 1,
            "description": "Those of different cultures and customs should be treated with respect, equally, fairly and with dignity."
          },
          {
            "type": "descriptive_norm",
            "description": "Inviting those with diverse cultures and customs for input.",
            "rank": 2
          },
          {
            "type": "descriptive_norm",
            "description": "Educating yourself on diverse cultures and customs in order to be more aware of discrimination.",
            "rank": 3
          },
          {
            "rank": 4,
            "type": "descriptive_norm",
            "description": "Those that encounter racism or discrimination should report it. E.g. To a tutor if it happens at University."
          },
          {
            "description": "Learning and respecting race, customs and cultural days, movements and celebrations.",
            "rank": 5,
            "type": "injunctive_norm"
          },
          {
            "rank": 6,
            "description": "To call out racism, prejudice and discrimination and defend those from it. (A Human Rights Ideal but may not be true in your community)",
            "type": "descriptive_norm"
          },
          {
            "rank": 7,
            "description": "Affirm those with diverse race and culture to provide input. ",
            "type": "desired_norm"
          },
          {
            "rank": 8,
            "type": "unpopular_norm",
            "description": "Making inappropriate negative comments based on anothers race, culture and customs.  This can be directly or indirectly."
          },
          {
            "rank": 9,
            "type": "unpopular_norm",
            "description": "Making inappropriate negative comments on diverse cultures, customs and traditions."
          },
          {
            "rank": 10,
            "type": "unpopular_norm",
            "description": "Shaming another person for their diverse culture and custom."
          },
          {
            "type": "unpopular_norm",
            "description": "Laughing inappropriately at another person for their diverse culture and customs.",
            "rank": 11
          },
          {
            "description": "Staring at another persons because of their diverse culture and customs.",
            "rank": 12,
            "type": "unpopular_norm"
          },
          {
            "rank": 13,
            "description": "Pointing at another persons because of their skin colour or diverse culture and customs.",
            "type": "unpopular_norm"
          },
          {
            "type": "unpopular_norm",
            "description": "Making jokes about another person because of their diverse culture and customs.",
            "rank": 14
          },
          {
            "rank": 15,
            "type": "unpopular_norm",
            "description": "Taking pictures of another persons for being different and using it on  the internet (such as social media or in group chats) to make fun."
          },
          {
            "rank": 16,
            "description": "Making offensive jokes about race, cultures and customs. The use of language and intent has the potential for this to also be a misdemeanor or felony.",
            "type": "infraction"
          },
          {
            "description": "Using hateful language or inciting violenace towards cultures and customs.",
            "type": "misdemeanor",
            "rank": 17
          },
          {
            "type": "felony",
            "rank": 18,
            "description": "Using hateful language or inciting violenace towards cultures and customs."
          }
        ],
        "event_name": "Respecting people from diverse cultures and the customs they practise."
      },
      {
        "rank": 15,
        "event_image_url": "https://api.neuroschemas.app/images/respect_political_beliefs_640x480.jpg",
        "event_name": "Respecting people of diverse political beliefs and interests.",
        "behaviours_available": true,
        "behaviours": [
          {
            "type": "prescriptive_norm",
            "rank": 1,
            "description": "Those of different political beliefs and interests should be treated with respect, equally, fairly and with dignity."
          },
          {
            "description": "Inviting those with political beliefs and interests to provide input.",
            "rank": 2,
            "type": "descriptive_norm"
          },
          {
            "type": "descriptive_norm",
            "description": "Educating yourself on some politics, history and diplomacy in order to be more aware of diverse views",
            "rank": 3
          },
          {
            "description": "Learning and respecting that others have different beginnings, views, and perceptions on life and the world we inhabit.",
            "type": "descriptive_norm",
            "rank": 4
          },
          {
            "rank": 5,
            "description": "Making inappropriate negative comments based on anothers political beliefs and interests.",
            "type": "unpopular_norm"
          },
          {
            "description": "Using hateful language or inciting violence based on political beliefs or interests.",
            "rank": 6,
            "type": "infraction"
          },
          {
            "type": "misdemeanor",
            "description": "Using hateful language or inciting violence based on political beliefs or interests.",
            "rank": 7
          },
          {
            "description": "Using hateful language or inciting violence based on political beliefs or interests.",
            "type": "felony",
            "rank": 8
          }
        ]
      }
    ],
    "type": "generic",
    "author_name": "Shaun Vos",
    "author_location": "GBR",
    "author_email": "",
    "author_twitter": "",
    "author_linkedin": "https://www.linkedin.com/in/shaunvos/",
    "author_website": "https://devmindset.co.uk/",
    "version": "1.0",
    "license": "GNU-GPLv3",
    "license_terms": "https://www.gnu.org/licenses/gpl-3.0.en.html",
    "updatedAt": { "$date": "2022-08-07T09:58:25+0000" }
  }
